import React from "react";
import { Link } from "react-router-dom";
import { useEffect } from "react";  
  export default function TheLastOfUs() {
      useEffect(() => {
      window.scrollTo({ top: 0, behavior: "auto" });
    }, []);
  
  return (
    <div className="min-h-screen bg-[#040410] text-white p-8 rtl">
      <h2 className="text-4xl font-bold text-center mb-8">The Last of Us</h2>

      <div className="flex flex-col lg:flex-row gap-8">
        {/* سمت چپ: عکس‌ها */}
        <div className="flex flex-col gap-4 lg:w-1/2">
          <img
            src="/elden pic1.jpg"
            alt="Last of Us 2"
            className="rounded-lg shadow-lg"
          />

          <img
            src="/elden pic.jpg"
            alt="Last of Us 1"
            className="rounded-lg shadow-lg"
          />
          <img
            src="/elden pic2.jpg"
            alt="Last of Us 3"
            className="rounded-lg shadow-lg "
          />
          <img
            src="/elden pic3..jpg"
            alt="Last of Us 4"
            className="rounded-lg shadow-lg"
          />
        </div>

        {/* سمت راست: متن */}
        <div className="lg:w-1/2 space-y-6 text-right rtl">
          <p className="text-[#c27575] text-lg ">
            الدن رینگ (به انگلیسی: Elden Ring) یک بازی ویدئویی در سبک نقش‌آفرینی
            اکشن و جهان باز است؛ که توسط فرام سافتور توسعه یافته و به‌وسیلهٔ
            باندای نامکو انترتینمنت در تاریخ ۲۵ فوریه ۲۰۲۲، برای پلت‌فرم‌های
            مایکروسافت ویندوز، ایکس‌باکس وان، ایکس‌باکس سری ایکس/اس، پلی‌استیشن
            ۴ و پلی‌استیشن ۵ منتشر شده است. این بازی به کارگردانی هیده‌تاکا
            میازاکی با همکاری رمان‌نویس فانتزی جرج آر. آر. مارتین ساخته شده است،
            که محتوای لازم برای تنظیمات بازی را فراهم کرده است. الدن رینگ بر طبق
            بازبینی جمعی وبگاه متاکریتیک مورد تحسین جهانی قرار گرفت، و برای
            داشتن جهان باز و روند بازی خوب مورد تحسین قرار گرفت، که به عنوان
            پیشرفتی در قواعد مجموعه سولز در نظر گرفته می‌شود. بازی الدن رینگ با
            کسب ۴۲۹ جایزه که یکی از آن‌ها بهترین بازی سال گیم آواردز است توانست
            رکورد آخرین بازمانده از ما قسمت ۲ را با ۳۲۶ جایزه بشکند و رکورد
            بیشترین تعداد جایزه را از آن خود کند و به پر افتخارترین بازی تاریخ
            تبدیل شد. این بازی در اکتبر ۲۰۲۲ از مرز فروش ۲۰ میلیون نسخه عبور
            کرده است که این میزان فروش الدن رینگ را به پر فروش‌ترین بازی سری
            بازی‌های سولز تبدیل کرده است. بسته الحاقی این بازی تحت عنوان سایه
            اِردتری (Shadow of Erdtree) در سال ۲۰۲۳ توسط شرکت فرام سافتور اعلام
            شد.
          </p>

          <h3 className="text-yellow-400 text-2xl font-semibold">گیم پلی</h3>
          <hr className="border-yellow-400" />
          <p className="text-[#c27575]">
            الدن رینگ یک بازی ویدئویی در سبک نقش‌آفرینی اکشن با زاویه دید سوم
            شخص است که در دنیایی خیالی به نام «سرزمین‌های میانه» جریان دارد و
            تمرکز روند بازی آن بر روی مبارزات و اکتشاف مشابه با عناصر دیگر
            بازی‌های توسعه یافته توسط فرام سافتور همانند مجموعه سولز، بلادبورن،
            و سکیرو: سایه‌ها دو بار می‌میرند می‌باشد. بازی شامل کلاس‌های مختلفی
            است، که در ابتدای بازی با انتخاب هر کلاس بازیکنان می‌توانند به
            ویژگی‌های آن دست یابند. کارگردان بازی هیده‌تاکا میازاکی، توضیح داده
            که بازیکنان ابتدا با یک دهانه خطی شروع به بازی می‌کنند، اما در نهایت
            با پیشرفت قادرند به اکتشاف در سرزمین‌های میانه، شامل شش منطقه اصلی،
            همچنین قلعه‌ها، دژها، و گوردخمه‌های پراکنده در سراسر نقشه جهان باز
            بپردازند. در طول بازی، بازیکنان با شخصیت غیرقابل‌بازی (اِن‌پی‌سی‌ها)
            و دشمنان، از جمله نیمه‌خدایان مواجه می‌شوند، که بر منطقه‌های اصلی
            حکمرانی می‌کنند و در نقش غول آخرهای اصلی بازی را ایفا می‌کنند.
            بازیکن قادر است به‌وسیلهٔ اسبی به نام تورنت، در دنیای میانه سریعتر
            کاوش کنند، این اسب قادر به پریدن بوده و بازیکن می‌تواند با استفاده
            از آن به مکان‌های گوناگون نقشه بازی سفر کند. تورنت، در اوایل بازی و
            پس از ملاقات با شخصیت ملینا در دسترس قرار می‌گیرد و با احضار بازیکن
            در زیر پای آن ظاهر خواهد شد. امکان سَفر سریع (Fast Travel) به
            نقطه‌هایی با نام site of grace در الدن رینگ مهیا است که بازیکن با
            انتخاب موقعیت موردنظر در دنیای میانه، می‌تواند به (site of grace) با
            کوچک‌ترین فاصلهٔ زمانی سفر کند. در الدن رینگ، بازیکنان می‌توانند از
            مخفی‌کاری نیز برای مبارزه با دشمنان استفاده کنند. حالا تصاویری از
            بازی را مشاهده میکنید:
          </p>

          <h3 className="text-yellow-400 text-2xl font-semibold">داستان</h3>
          <hr className="border-yellow-400" />
          <p className="text-[#c27575]">
            الدن رینگ در تمام بخش‌های «سرزمین‌های میانه» (Lands Between) قرار
            دارد، قلمروی که توسط یک خدای بیرونی با نام «گریتر ویل» (Greater
            Will) اداره می‌شود. گریتر ویل این سرزمین را با چند روون جادویی و یک
            درخت عظیم و طلایی با نام «اردتری»(Erdtree) توانمند می‌سازد. گریتر
            ویل ملکه ماریکا (Marika) را به عنوان فرمانروای سرزمین در کنار همسرش
            که مقام الدن لرد را داشته باشد قرار داد. در ابتدا گادفری (Godfrey)
            همسر ماریکا بود اما ماریکا به دنبال قدرت بیشتری بود به همین دلیل با
            نیمه مردانه خود راداگون (Radagon)ازدواج کرد. ماریکا برای اطمینان از
            حکومت ابدی خود در سرزمین‌های میانه، رون مرگ را به «ملیکِث دِ بلک
            بلید» (Maliketh the Black Blade) سپرد تا برای همیشه حکومت را در
            اختیار داشته باشد. اما همه چیز در سرزمین‌های میانه برابر نبود همانند
            «اومن‌ها»(Omens) که در واقع انسان‌هایی بودند که با نقص و نفرینی به
            دنیا می‌آمدند و ماریکا آنها را از سرزمین میانه تبعید می‌کرد. پس از
            اینکه اولین فرزند ماریکا با نام «گادوین د گلدن» (Godwyn the Golden)
            با استفاده از یک قطعه ربوده شده از رون مرگ کشته شد، ماریکا الدن رینگ
            را شکست و موجب رویداد «Shattering» شد و همین باعث شد تا در داخل درخت
            اردتری توسط خار حبس شود و تکه‌های مختلف الدن رینگ به عنوان رون‌های
            بزرگ به فرزندان ماریکا به ارث رسید. «مورگات» (Morgott) یک اومن که با
            وجود تبعید همچنان به ماریکا وفا دار بود، «موگ» (Mohg) دوقلوی مورگات
            که قصد داشت حکومت اومن‌ها را تشکیل دهد و فرمانروایی کند، «ژنرال
            رادان» (General Radahn) جنگجویی که به دلیل مبتلا شدن به سم اسکارلت
            (Scarlet Rot) خلق و خوی وحشی گرفت، «ریکارد» (Rykard) جنگجویی که برای
            قدرت گرفتن حاضر شد به تمامی قدرت‌ها پشت کند و با یک مار درهم آمیخته
            شود تا حکومت خودش را تشکیل دهد، «رانی» (Ranni) جادوگری که به دنبال
            سرنگونی گریتر ویل بود، «میکلا» (Miquella) نابغه محبوبی که با نفرین
            ماندن در بدن نوجوانی خود تا ابد بود و «مالنیا» (Malenia) دوقلوی
            میکلا که با نفرین مادرزادی وجود سم اسکارلت در بدنش به دنیا آمد. در
            بازی، شخصیت قابل بازی از نژادی به نام «تارنیشد» (Tarnished؛ در لغت
            به‌معنای از جلا افتاده) است، یکی از گروه‌های تبعیدی از «سرزمین‌های
            میانه» که پس از رویداد «Shattering» دوباره احضار می‌شوند. به عنوان
            یکی از افراد تارنیشد، بازیکن باید قلمرو را طی کند تا الدن رینگ را
            تعمیر کرده و به «اِلدن لُرد» تبدیل شود.
          </p>

          {/* جدول سیستم مورد نیاز */}
          <div className="flex flex-col md:flex-row gap-8">
            <div className="flex-1">
              <h5 className="text-yellow-400 font-semibold mb-2">
                حداقل سیستم مورد نیاز
              </h5>
              <table className="table-auto border border-yellow-400 text-white w-full">
                <tbody>
                  <tr>
                    <td className="border border-yellow-400 p-2">سیستم عامل</td>
                    <td className="border border-yellow-400 p-2">
                      WINDOWS 10 64-BIT VERSION 1909 OR NEWER
                    </td>
                  </tr>
                  <tr>
                    <td className="border border-yellow-400 p-2">پردازنده</td>
                    <td className="border border-yellow-400 p-2">
                      AMD RYZEN 5 1500X INTEL CORE i7-4770K
                    </td>
                  </tr>
                  <tr>
                    <td className="border border-yellow-400 p-2">
                      کارت گرافیک
                    </td>
                    <td className="border border-yellow-400 p-2">
                      AMD RADEON 470 (4 GB) NVIDIA GEFORCE GTX 970 (4 GB)
                    </td>
                  </tr>
                  <tr>
                    <td className="border border-yellow-400 p-2">رم</td>
                    <td className="border border-yellow-400 p-2">
                      16 گیگابایت
                    </td>
                  </tr>
                  <tr>
                    <td className="border border-yellow-400 p-2">فضای خالی</td>
                    <td className="border border-yellow-400 p-2">
                      100 گیگابایت SSD
                    </td>
                  </tr>
                </tbody>
              </table>
            </div>

            <div className="flex-1">
              <h5 className="text-yellow-400 font-semibold mb-2">
                سیستم پیشنهادی
              </h5>
              <table className="table-auto border border-yellow-400 text-white w-full">
                <tbody>
                  <tr>
                    <td className="border border-yellow-400 p-2">سیستم عامل</td>
                    <td className="border border-yellow-400 p-2">
                      WINDOWS 10 64-BIT VERSION 1909 OR NEWER
                    </td>
                  </tr>
                  <tr>
                    <td className="border border-yellow-400 p-2">پردازنده</td>
                    <td className="border border-yellow-400 p-2">
                      AMD RYZEN 5 3600X INTEL CORE i7-8700
                    </td>
                  </tr>
                  <tr>
                    <td className="border border-yellow-400 p-2">
                      کارت گرافیک
                    </td>
                    <td className="border border-yellow-400 p-2">
                      AMD RADEON RX 5800 XT (8 GB) AMD RADEON RX 6600 XT (8 GB)
                    </td>
                  </tr>
                  <tr>
                    <td className="border border-yellow-400 p-2">رم</td>
                    <td className="border border-yellow-400 p-2">
                      16 گیگابایت
                    </td>
                  </tr>
                  <tr>
                    <td className="border border-yellow-400 p-2">فضای خالی</td>
                    <td className="border border-yellow-400 p-2">
                      100 گیگابایت SSD
                    </td>
                  </tr>
                </tbody>
              </table>
            </div>
          </div>

          <h3 className="text-yellow-400 text-2xl font-semibold mt-6">
            بازخورد
          </h3>
          <hr className="border-yellow-400" />
          <p className="text-[#c27575]">
            به‌طور کلی بازی «الدن رینگ» مورد تحسین منتقدین قرار گرفت. بالغ بر
            نهصد هزار بیننده در توییچ تنها پس از ۲۴ ساعت داشته که این مقدار، آن
            را تبدیل به سومین نمایش بزرگ پس از سایبرپانک ۲۰۷۷ و آرک کرد.
            گیم‌اسپات گسترده بودن جهان باز بازی و جزئیات خیره کننده که موجب کاوش
            بازیکنان در گوشه کنار جهان بازی می‌شود را جذابیت اصلی بازی نامید.
            آی‌جی‌ان نیز کاوش‌های مختلف و متفاوت در جای جای نقشه بازی را مورد
            تحسین قرار داد. گاردین در تیتری بازی را «جذاب و مبتکرانه» عنوان کرد
            و جزئیات نقشه آن را به زیبایی سری بازی‌های افسانه زلدا اعلام کرد و
            محیط جهان‌های تاریک و روشن بازی را به خاطر طراحی هنری زیبایش مورد
            تقدیر قرار داد. درجه سختی بازی که همانند بازی‌های قبلی فرام سافتور
            هیچ حالت آسانتری وجود نداشت موجب هم ستایش و هم انتقاد برخی منتقدین
            شد. برخی عدم وجود حالت آسان در بازی را ضعف بازی دانسته و برخی دیگر
            آن را که موجب چالش بیشتر بازیکنان می‌شود را مورد تقدیر قرار دادند.
            تنوع بازیکنان برای انتخاب سبک مبارزه در برابر دشمنان و در عین حال
            چالش‌برانگیز بودن آنها یکی از نقاط قوت بازی مطرح شد. وجود اسب و
            قابلیت «سفر سریع» با استقبال منتقدین همراه شد که باعث آسان شدن کاوش
            در بازی شد. داستان بازی الدن رینگ که به قلم جرج آر. آر. مارتین و سبک
            نوشتاری وی بود مورد توجه منتقدین قرار گرفت. ارز تکنیکا طرح داستان
            بازی را «رمز آلود و پراکنده» نامید و عنوان کرد که این سبک نوشتار بر
            پایه طرح داستان‌های فرعی برای فهماندن داستان به مخاطب به جای اعلام
            داستان مستقیم به وی می‌باشد
          </p>

          {/* دکمه خرید */}
          <div className="flex gap-10 mt-6 items-center justify-center flex">
            <a
              href="https://store.steampowered.com/app/1888930/The_Last_of_Us_Part_I/"
              target="_blank"
            >
              <button className="bg-gradient-to-r from-yellow-400 to-red-600 text-black font-bold py-2 px-6 rounded-lg shadow-lg hover:scale-105 transition-transform">
                استیم
              </button>
            </a>
            <Link to="/">
              <button className="bg-gradient-to-r from-red-600 to-yellow-400 text-black font-bold py-2 px-6 rounded-lg shadow-lg hover:scale-105 transition-transform">
                بازگشت
              </button>
            </Link>
          </div>
        </div>
      </div>
    </div>
  );
}
